---
type: Revolution
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# Revolution

`Autodesk.Revit.DB.Revolution` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Axis | — | `public ModelLine Axis { get ; }` |
| Property | EndAngle | — | `public double EndAngle { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | Sketch | — | `public Sketch Sketch { get ; }` |
| Property | StartAngle | — | `public double StartAngle { get ; set ; }` |